Resources.md

# Table of Contents

1.  [Resources](#orgc2333fa)
    1.  [Prerequisites](#org938ebca)
        1.  [Python](#org7ce6723)
        2.  [Jupyter](#orgcd5df0b)
        3.  [Github](#org4100c87)
        4.  [Numpy and other Libraries](#orga5103c5)
        5.  [Common Terminologies](#orgcc02c15)
        6.  [Links](#org4d4f432)
    2.  [Resource Hubs](#orga30d318)
    3.  [Machine Learning Intro](#org1d02013)
    4.  [Neural Networks](#org612036b)
    5.  [Clustering](#org65b14fe)
    6.  [What are Genetic Algorithms?](#org3c605fe)
    7.  [Cool Applications of AI](#orga1e6d9c)



<a id="orgc2333fa"></a>

# Resources


<a id="org938ebca"></a>

## Prerequisites


<a id="org7ce6723"></a>

### Python

-   [Corey Schafer Videos](https://www.youtube.com/playlist?list=PL-osiE80TeTskrapNbzXhwoFUiLCjGgY7)
-   [Automate the boring stuff](https://automatetheboringstuff.com/) : For other interesting python projects


<a id="orgcd5df0b"></a>

### Jupyter

-   [Jupyter Notebook Quickstart](https://jupyter.readthedocs.io/en/latest/install.html)


<a id="org4100c87"></a>

### Github

-   [Github Guides](https://guides.github.com/)
-   [Git tower videos](https://www.git-tower.com/learn/git/videos)
-   [Git tower ebook](https://www.git-tower.com/learn/git/ebook/en/command-line/introduction)


<a id="orga5103c5"></a>

### Numpy and other Libraries

-   [Numpy Quickstart guide](https://docs.scipy.org/doc/numpy/user/quickstart.html)
-   [CS231N Tutorials](http://cs231n.github.io/python-numpy-tutorial/)


<a id="orgcc02c15"></a>

### Common Terminologies

Learn about the following terminologies:

-   Accuracy, Precision and F-Score
-   Curse of Dimensionality
-   Bias Variance Tradoff
-   Loss Functions


<a id="org4d4f432"></a>

### Links

-   [Wikipedia Accuracy vs Precision](https://en.wikipedia.org/wiki/Accuracy_and_precision)
-   [Wikipedia Bias vs Variance](https://en.wikipedia.org/wiki/Bias%E2%80%93variance_tradeoff)
-   [Wikipedia Curse of Dimensionality](https://en.wikipedia.org/wiki/Curse_of_dimensionality)


<a id="orga30d318"></a>

## Resource Hubs

-   [Awesome Deep Learning - Github \*\*](https://github.com/ChristosChristofidis/awesome-deep-learning)


<a id="org1d02013"></a>

## Machine Learning Intro

-   [Visual Introduction to Machine Learning Part 1](http://www.r2d3.us/visual-intro-to-machine-learning-part-1/)
-   [Visual Introduction to Machine Learning Part 2](http://www.r2d3.us/visual-intro-to-machine-learning-part-2/)
-   [Introduction to Curse of Dimensionality](http://www.visiondummy.com/2014/04/curse-dimensionality-affect-classification/)
-   [Google&rsquo;s Crash Course](https://developers.google.com/machine-learning/crash-course)


<a id="org612036b"></a>

## Neural Networks

-   [Neural Networks as arbitrary function fitters](http://neuralnetworksanddeeplearning.com/chap4.html)
-   [3B1B What is a Neural Network?](https://www.youtube.com/watch?v=aircAruvnKk)
-   [Computational Graphs Explained](https://medium.com/tebs-lab/deep-neural-networks-as-computational-graphs-867fcaa56c9)


<a id="org65b14fe"></a>

## Clustering

-   [Wikipedia Clustering](https://en.wikipedia.org/wiki/Cluster_analysis)
-   [5 Clustering Algorithms](https://towardsdatascience.com/the-5-clustering-algorithms-data-scientists-need-to-know-a36d136ef68)


<a id="org3c605fe"></a>

## What are Genetic Algorithms?

-   [UC Davis Introduction to Genetic Algorthms](https://web.cs.ucdavis.edu/~vemuri/classes/ecs271/Genetic%20Algorithms%20Short%20Tutorial.htm)
-   [Evolutionary computation course (AEC 02 and 03 only)](https://github.com/lmarti/evolutionary-computation-course)
-   [Genetic Algorithms simply explained](https://lethain.com/genetic-algorithms-cool-name-damn-simple)
-   [David Goldberg&rsquo;s Book on Genetic Algorithms and Soft Computing](./David_E_Goldberg.pdf)
-   


<a id="orga1e6d9c"></a>

## Cool Applications of AI

-   [Pixrv](http://affinelayer.com/pixsrv)
-   [This person does not exist](https://thispersondoesnotexist.com/)
-   [Quick Draw](https://quickdraw.withgoogle.com/)
-   [Google-AI Experiments](https://experiments.withgoogle.com/collection/ai)

